Revit 2027 API
ZoneEquipment.GetAssociatedZoneEquipment(Document, ElementId) Method
 Gets the associated zone equipment of the specified analytical space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ISet<ElementId> GetAssociatedZoneEquipment(
	Document document,
	ElementId spaceElementId
)
Public Shared Function GetAssociatedZoneEquipment (
	document As Document,
	spaceElementId As ElementId
) As ISet(Of ElementId)
public:
static ISet<ElementId^>^ GetAssociatedZoneEquipment(
	Document^ document,
	ElementId^ spaceElementId
)
static member GetAssociatedZoneEquipment :
        document : Document *
        spaceElementId : ElementId -> ISet<ElementId>
Parameters
document Document
 The document where the analytical spaces and zone equipment exist.
spaceElementId ElementId
 The specified analytical spaces.
Return Value
ISet<ElementId>
 All associated zone equipment, either explicitly assigned or implicitly assigned via system-zone.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ZoneEquipment Class
GetAssociatedZoneEquipment Overload
Autodesk.Revit.DB.Mechanical Namespace